# HW3

# 1 Зформуйте строку, яка містить певну інформацію про символ в відомому слові. Наприклад "The [номер символу] symbol in [тут слово] is '[символ з відповідним порядковим номером]'". Слово та номер отримайте за допомогою input() або скористайтеся константою. Наприклад (слово - "Python" а номер символу 3) - "The 3 symbol in "Python" is 't' ".

# Создаю функцию , которая определяет элемент в строен по индексу

def elem_finder(index):
    return main_word[index - 1:index]

# Получаем входные данные

index = int(input('Введите номер символа: '))
main_word = str(input('Введите слово: '))

symbol_index = elem_finder(index)

# Выводим результат

print("The" + ' ' + str(index) + ' ' + "symbol in" + ' ' + main_word + ' ' + "is" + ' ' + str(symbol_index))

# 2 Вести з консолі строку зі слів (або скористайтеся константою). Напишіть код, який визначить кількість кількість слів, в цих даних.

# Получаем входные данные

string = str(input('Введите предложение: '))

# Выводим результат

print(len(string.split()))

# 3 Існує ліст з різними даними, наприклад lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']. Напишіть механізм, який сфлрмує новий list (наприклад lst2), який би містив всі числові змінні, які є в lst1. Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.

# Получаем входные данные

lst1 = str(input('Создайте список: '))

# Импортируем регулярки и убираем шаблоны на нужную подстроку

import re
lst2 = [re.sub('\D+', '', i) for i in lst1]
print(lst2)
